// დავალება 1.
// ჩართეთ: https://www.youtube.com/watch?v=5qap5aO4i9A
// უფრო სწორედ, მე ჯერ გამოვცვალე ფონი სურათი: https://wallpaperaccess.com/cool-4k-desktop
// ავირჩიე მეშვიდე ფოტო და შეუდექი საქმეს და სიმღერებიდან ჩავრთე სხვა, რაც მოგვაწოდეთ, ეგ მქონდა
// დიდიხანი main-ად და ჩავრთე უკვე ეს: https://www.youtube.com/watch?v=jQbgkcd2x7w&t=790s&ab_channel=MusicLab 
// როგორც ვხედავ მეტაინფორმაციას აგროვებთ :DDD

describeYourSelf();
function describeYourSelf(){
    // const-ები არ დაგავიწყდეთ, თორე შემდეგზეც მოვა ეს დავალება 
    // დავალება 1:
    // 5 ცვლადში აღწერეთ თქვენი თავი. 
    const active = 'აქტიური პერსონა ვარ';
    const interestingThing = "ბევრი ფიქრობს, რომ ვარ კალათბურთელი, ეგ ყველაფერი იმის გამო, რომ ვარ 196";
    const think = 'ხშირად ძალიან მეზრდება ინტერესი არა მარტო პროგრამირების განხრით და შემიძლია თავი დაუდო, მაგრამ ახლა უფრო პროგრამირება';
    const studying = 'ვარ სტუდენტი IT-ის განხრით, რომელიც ასე მიზიდავს, ცოტა სასაცილოდ ჟღერს';
    const language = 'მაინტერესებდა ბევრი ენის შესწავლა და მერე მაგათი, როგორც პროფესორი გამომეყენებინა, მაგრამ მაშინ პატარა ვიყავი არ მეგონა, რომ ამდენი იქნებოდა';
    // 5 ცვლადში აღწერეთ თქვენი ერთ-ერთი საყვარელი სიმღერა
    const aboutSong1 = 'ეგ ცოტა პრობლემატურია, იმიტომ რომ ვერ ავირჩევ საყვარელს';
    const aboutSong2 = 'უფრო იმას ვიტყვი, რომ ლისტში მაქვს ყველანაირი სიმღერის ტიპი, მაგრამ მეტად აქტიური სიმღერები';
    const aboutSong3 = 'Linkin Park-იც მომწონს თუნდაც, რომ ვთქვათ';
    const aboutSong4 = 'ასევე Overlord-ის მესამე სეზონის ოპენინგი';
    const aboutSong5 = "Linkin Park-დან მაგალითად What I've Done ტრანსფორმერების დახმარებით ვიპოვნე ეგ შედევრი";
    // 5 ცვლადში აღწერეთ თქვენი ერთ-ერთი საყვარელი ფილმი
    const aboutLikedFilm1 = 'ქართულად ვერ გავიხსენე სახელწოდება რუსულად Хроники нарнии';
    const aboutLikedFilm2 = 'მახსოვს, რომ ეს არის ფანტასტიკის ჟანრის ფილმი';
    const aboutLikedFilm3 = 'მანდ საინტერესოდ მიდის პერსონაჟების განვითარება და მათი მოქმედებები';
    const aboutLikedFilm4 = "ასევე სუჟეტიც საინტერესოა, რომ არ მახსოვს, თუ რამდენჯერ მქონდა ნაურები, როგორც The Sorcerer's apprentice "
    const aboutLikedFilm5 = 'როგორც ასეთი, ეს ზღაპარი ძალიან საინტერესოა';
    // 5 ცვლადში აღწერეთ ბოლოს რა წიგნი წაიკითხეთ
    const lastReadBook1 = 'Побег из шоушенко';
    const lastReadBook2 = 'День шакала';
    const lastReadBook3 = 'Последный игрок приготовится';
    const lastReadBook4 = 'Морской волк';
    const lastReadBook5 = 'Дориан Грей';
    // 5 ცვლადში აღწერეთ ფილმი Titanic
    const filmTitanic1 = 'მახსოვს რომ მანდ თამაშობენ ცნობილი, უფრო სწორედ დღევანდელი დღისთვის ცნობილი მსახიობები, ლეონარდო დეკაპრიო, კეიტ უინსლეტი, ვიქტორ გარბერი, იოან გრიფიტ...';
    const filmTitanic2 = 'ეს არის სასიყვარულო ფილმი, სადაც ერთმანეთს პოულობენ მთავარი გმირები და გრძნობენ სიყვარულს ერთმანეთის მიმართ';
    const filmTitanic3 = 'მათი ლაინერი, რომელიც მიცურავდა ატლანტიკის ოკეანში უცაბედად დაეტაკება ყინულს';
    const filmTitanic4 = 'მერე ეს უკვე გადაიქცევა სიკვდილთან ბრძოლა';
    const filmTitanic5 = 'სადაც აღარ ექნება ადგილი იმდენათ სიყვარულს ზი ენდ';
    // 3 ცვლადში აღწერეთ თქვენი საყვარელი საჭმელი
    const food1 = 'საჭმელი წავიკითხე და მომშივდა, წითელი ბორში მომინდა';
    const food2 = 'ასევე ჩაშუშული სოკო არაჟანში';
    const food3 = 'მგონი ვიცი რითი დავკავდები უახლოეს ნახევარ საათში';
    // 5 ცვლადში აღწერეთ თქვენი საბანკო მონაცემები :) 
    
    // 5.1. წინა დავალებაში ყალბი მონაცემები შეიყვანეთ

    // 6 ცვლადში აღწერეთ თქვენი კომპიუტერი (მაგ: memory=16000 isSSD=true cpu='intel core ix' graphics:'') 
    // თან გაეცნობით თქვენს კომპიუტერს. მონაცემები გთხოვთ იყოს ზუსტი...

    

    // დავალება 2.1:
    // თქვენი საყვარელი წიგნის გამოშვების წელი შეადარეთ ფილმის გამოშვების წელს დაწერეთ რომელია უფრო მეტი

    // დავალება 2.2:
    // თუ თქვენი საყვარელი საჭმელი ცხარე არ არის გამოიტანეთ Food not spicy

    // დავალება 2.3:
    // თუ თქვენი კომპიუტერის RAM - ნაკლებია 8000-მეგაბაიტზე გამოიტანეთ. "რამი მექნება მალე დასამატებელი"

    // დავალება 2.4
    // თუ isSSD - არ არის true მაშინ გამოიტანეთ: "სასურველია SSD - ჩავდგათ"

    // დავალება 3:
    // თქვენი ასაკი გაზარდეთ 4-ით

    // დავალება 4:
    // თუ თქვენი საყვარელი ფილმის გამოშვების წელია: 1950-დან 1970 წლამდე: დაბეჭდეთ: "ძველი ფილმია"
    // ხოლო თუ ის გამოსულია 2010-დან 2020მდე დაწერეთ: "ახალი ფილმია"

    // დავალება 5:
    // გამოიძახეთ isAdult ფუნქცია და გადააწოდეთ მას თქვენი ასაკი. isAdult() თუ დააბრუნებს - true-ს გამოიტანეთ: "მე შემიძლია ხმის მიცემა"
    // თუ არა: ჯერ ხმის მიცემის უფლება არ მაქვს

    // დავალება 6
    // დაწერეთ ფუნქცია calculateAgeBasedOnBirthYear(birthYear); - ამ ფუნქციამ 2021-ს უნდა გამოაკლოს დაბადების წელი და უკან დააბრუნოს მიღებული რიცხვი
    // calculateAgeBasedOnBirthYear()-ის მიერ დაბრუნებული რიცხვი შეადარეთ თქვენ მიერ დეკლარირებულ ასაკს
    // თუ ასაკი დაემთხვა: გამოიტანეთ: "თვლა მცდონია" თუ არა: "თვლაში მიჭირს"

    let first = Number(prompt('Pirveli ricxvi'))
    let sec = Number(prompt('Meore ricxvi'))
    
    // დავალება 7 დაწერეთ ფუნქცია sum() - რომელიც დააკმაყოფილებს მოცემულ გამოძახებას:
    let res = sum(first, sec);
    console.log('Sum', res);
    
    // დავალება 8:
    // ზემოთ დაწერილი ფუნქციის მაგვარად დაწერეთ ფუნქციები multiply, divide, subract, გამოიძახეთ ისინი და გამოიტანეთ მათი შედეგები
    // console.log()-აბი არ გამოიყენოთ არცერთ ზემოთ აღნიშნულ ფუნქციაში(multiply, divide, subract)

    // დავალება 9
    // გამოიძახეთ ფუნქია multPositiveNumbers - რიცხვებით 10 და 20 და დაბეჭდეთ რეზულტატი
    // გამოიძახეთ ფუნქცია multPositiveNumbers - რიცხვებით -10 და 20 და დაბეჭდეთ რეზულტატი
    // გამოიძახეთ ფუნქცია multPositiveNumbers - რიცხვებით 10 და -20 და დაბეჭდეთ რეზულტატი
    // ზემოთ ფუნქციის მიერ დაბრუნებული მნიშვნელობები შეინახეთ ცვლადებში
    // შეადარეთ ცვლადები. თუ რომელიმე არ დაემთხვა რომელიმე სხვას დაბეჭდეთ "ფუნქციაში შეცდომაა"
    

    // დავალება 10:
    // დაწერეთ ფუნქცია multNegative(); ამ ფუნქციის მიზანია ნამრავლი სულ უარყოფითი იყოს
    let neg1 = multNegative(5, 10);
    let neg2 = multNegative(-5, 10);
    let neg3 = multNegative(5, -10);
    let neg4 = multNegative(-5, -10);
    
    console.log('multNegative -ის შედეგები', neg1, neg2, neg3, neg4);
    // თუ რომელიმე ზემოთ გამოძახებული ცვლადი უარყოფითია, ფუნქციაში გაქვთ შეცდომა


}

function isAdult(age){
    let isAdult = age >= 18;
    
    return isAdult; 
}

// don't forget to add arguments
function multNegative(){
    // Impelement multNegative function here
}


function multPositiveNumbers(num1, num2){
    if(num1 < 0){
        // if num1 is less than 0 we multiply it by 1 to always get positive number
        num1 = (num1 * -1);
    }
    if(num2 < 0){
        // if num1 is less than 0 we multiply it by 1 to always get positive number
        num2 = (num2 * -1);
    }

    // BTW: ეს არ არის საუკეთესო გადაწყვეტილება ამ ფუნქციის. გაცილებით უფრო მარტივადაც შეიძლება. 1 გამრავლებით. 

    return num1 * num2;
}